In [53]:
import pandas as pd
import numpy as np

In [54]:
df = pd.read_csv('income.csv')
df

        Name    Income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

In [55]:
df.describe()

             Income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [56]:
df.Income.quantile(0.25)

5500.0

In [57]:
df.Income.quantile(0.5)

7000.0

In [58]:
df.Income.quantile(0.25, interpolation='lower')

5000

In [59]:
df.Income.quantile(0.25, interpolation='higher')

6000

In [60]:
perc_99 = df.Income.quantile(0.99)
perc_99

9400479.999999994

In [61]:
df[df.Income > perc_99]

        Name    Income
6  Elon Musk  10000000

In [62]:
df_no_outlier = df[df.Income <= perc_99]
df_no_outlier

    Name  Income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

In [63]:
df.loc[3,'Income'] = np.NaN
df

        Name      Income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [64]:
df.Income.mean()

1671666.6666666667

In [65]:
df.Income.median()

6500.0

In [66]:
df.Income.mode()

0        4000.0
1        5000.0
2        6000.0
3        7000.0
4        8000.0
5    10000000.0
Name: Income, dtype: float64